---
kind: method
id: M:Autodesk.Revit.DB.UpdaterId.GetGUID
source: html/e375fb41-ade8-7092-02c7-10739d3a5f75.htm
---
# Autodesk.Revit.DB.UpdaterId.GetGUID Method

GUID value of the UpdaterId

## Syntax (C#)
```csharp
public Guid GetGUID()
```